const TranslateText = {
    ua: {
        header: {
            menu: {
                shop: "Магазин",
                bag: "Сумки",
                backpack: "Рюкзаки",
                wallets: "Гаманці",
                brand: "Бренди",
                about: "Про нас",
                contacts: "Контакти",
            },
            work: {
                head: "Графік роботи",
                time: "пн-сб: 10:00 - 20:00",
                holiday: "нд: Вихідний",
            },
        },
        main: {
            bag: "Сумки",
            backpack: "Рюкзаки",
            wallets: "Гаманці",
        },
        contacts: {
            contactHead: "Контактна інформація",
            cbHead: "Зворотній зв’язок",
            inputs: {
                name: "Ваше ім’я",
                mail: "Пошта",
                tel: "Номер телефону",
                msg: "Ваше повідомлення",
                btn: "Відправити",
            },
        },
        footer: {
            return: "Обмін та повернення",
            terms: "Положення та умови",
            delivery: "Перевезення та доставка",
            contacts: "Контакти",
        },
        products: {
            filters: {
                price: "Ціна",
                brand: "Бренди",
                from: "від",
                to: "до",
            },
            btn: "Фільтри",
        },
        cart: {
            btnBuy: "Оформити замовлення",
            btnMore: "Оновити кошик",
            total: "Разом",
        },
        userCart: {
            header: "Особиста інформація",
            name: "Ім'я",
            secondname: "Прізвище",
            phone: "Телефон",
            address: "Адреса",
            deliveryMethod: "Метод доставки",
            courier: "Кур'єр",
            np: "Нова Пошта",
            own: "Самовивіз",
            payMethod: "Метод оплати",
            card: "Карта",
            ondelivery: "При отриманні",
            btn: "Підтвердити замовлення",
            alerts: {
                ok: "Ваше замовлення прийняте в обробку! спасибі",
                orderId: "Ваш номер замовлення: ",
                warn: "Щось пішло не так",
                error: "Помилка із створенням замовлення. Зателефонуйте для замовлення",
                cardError: "Оплата карткою не доступна",
                name: "Ім'я не вказано",
                secName: "Прізвище не вказане",
                address: "Телефон не вказано",
                phone: "Адреса не вказана",
            },
        },
        successPage: {
            head: "Дякуємо!",
            ok: "Ваше замовлення прийнято!",
        },
        return: () => (
            <>
                <h1>Обмін та повернення</h1>
                <p>
                    1. Щоб оформити обмін/повернення замовлення, ваш товар має
                    бути в тому ж стані, в якому ви його отримали, неношений або
                    невикористаний, з бирками та в оригінальній упаковці. Вам
                    також знадобиться квитанція або підтвердження покупки.
                </p>
                <p>
                    2. Зверніться до нас за адресою emailcompany@gmail.com, щоб
                    розпочати обмін/повернення протягом 14 днів з дати отримання
                    замовлення. Якщо ваш обмін/повернення буде прийняте, ми
                    надішлемо вам інструкції як і куди надіслати посилку.
                </p>
                <p>
                    3. Будь ласка, перевірте своє замовлення при отриманні та
                    невідкладно зв'яжіться з нами, якщо товар несправний,
                    пошкоджений або якщо ви отримали не той товар, щоб ми могли
                    оцінити проблему та виправити її.
                </p>
                <p>
                    4. Ви несете відповідальність за доставку нам ваших
                    повернень за допомогою перевізника на ваш вибір. Щойно ми
                    отримаємо ваше повернення та перевіримо якість, ми обробимо
                    ваше відшкодування за допомогою способу оплати, який
                    використовувався в оригінальному замовленні. Зверніть увагу,
                    що ми не несемо відповідальності за будь-які зміни курсів
                    валют.
                </p>
                <p>
                    5. Ми залишаємо за собою право не приймати
                    обмінені/повернені товари, якщо вони були відправлені на наш
                    склад після 14-денного терміну, або якщо стан товарів
                    відрізняється від того, в якому ви їх отримали.
                </p>
                <p>
                    6. На жаль, ми не приймаємо обмін/повернення товарів зі
                    спливом 14 днів з дати отримання замовлення.
                </p>
                <p>
                    7. Ми повідомимо вас, як тільки отримаємо і перевіримо ваш
                    обмін/повернення, і повідомимо, чи було обмін/повернення
                    схвалено, чи ні. При схваленні повернення вам будуть
                    автоматично повернені кошти початковим способом оплати.
                    Пам'ятайте, що вашому банку або емітенту кредитної картки
                    також може знадобитися деякий час, щоб обробити та здійснити
                    повернення.
                </p>
                <p>
                    8. Зверніть увагу, що при оплаті банківською картою термін
                    повернення коштів залежить від політики банку, який випустив
                    картку.
                </p>
            </>
        ),
        terms: () => (
            <>
                <h1>Положення та умови</h1>
                <p>
                    Кожен раз, коли ви використовуєте цей веб-сайт, ви
                    погоджуєтеся з умовами Політики приватності, яка діє в
                    будь-який час, і вам слід ознайомитися з цим текстом, щоб
                    переконатися, що ви згодні з ним.
                </p>
                <p>
                    1. Персональні дані, які ви надаєте, будуть оброблятися і
                    зберігатися у файлі під відповідальністю Bags de reve з
                    метою:
                </p>
                <p>
                    {" "}
                    I. Розробки, забезпечення та виконання умов договору
                    купівлі-продажу придбаних вами товарів або будь-якого іншого
                    договору між двома сторонами;
                </p>
                <p> II. Обробки ваших запитів;</p>
                <p>
                    {" "}
                    III. Надання вам інформації про товари, знижки та інші
                    оновлення;
                </p>
                <p>
                    {" "}
                    IV. У випадку, якщо ви надаєте нам інформацію про третіх
                    осіб, ви несете відповідальність за інформування та
                    отримання їх згоди на надання цієї інформації в цілях,
                    описаних нижче. У разі придбання товару, надана інформація
                    третьої сторони буде використовуватися тільки для (а)
                    організації доставки або перевірки отримання товару і (б)
                    участі в обробці будь-якому вхідного запиту, який може
                    виникнути у вас або третьої сторони;
                </p>
                <p>
                    2. Особиста інформація, надана через контактну форму
                    продажів в магазині, доступну на веб-сайті, а також
                    інформація, надана електронною поштою службі підтримки
                    клієнтів, буде оброблятися Bags de reve і буде
                    використовуватися виключно для вирішення поставлених
                    запитань.
                </p>
                <p>
                    3.Bags de reve несе відповідальність за файл, зобов'язується
                    дотримуватися конфіденційності вашої особистої інформації і
                    гарантує, що ви зможете скористатися своїми правами на
                    доступ, зміну, скасування і заперечення даних по електронній
                    пошті на адресу emailcompany@gmail.com. За необхідності ми
                    попросимо вас надати нам копію вашого посвідчення особи —
                    паспорта або іншого дійсного документа, що посвідчує особу.
                    У разі, якщо ви вирішите скористатися такими правами якщо
                    ваша електронна пошта є частиною персональних даних, які ви
                    нам надали, ми будемо вдячні, якщо у цьому випадку буде
                    описана обставина, що вказує на адресу електронної пошти, на
                    яку здійснюються права, зміни, скасування та заперечення.
                </p>
            </>
        ),
        about: () => (
            <>
                <h1>Про нас</h1>
                <p>
                    Bags de rêve - місце,де кожен знайде ту ідеальну сумку чи
                    рюкзак .
                </p>
                <p>
                    Світові бренди з відмінною якістю та доступною ціною-це про
                    нас.
                </p>
                <p>Вся продукція є оригінальною.</p>
                <p>
                    Широкий асортимент включає в себе від класичних моделей до
                    оригінальних дизайнерських рішень.
                </p>
                <p>
                    Bags de rêve має в своєму арсеналі такі всесвітньовідомі
                    бренди як:Céline,Versace,Ermanno Scervino,Brunello
                    Cucinelli,Patrizia Pepe ,Moschino ,Love Moschino,Moschino
                    Couture,Valentino та багато інших.
                </p>
                <p>
                    Наші спеціалісти проводять ретельну селекцію товару
                    ґрунтуючись на модних тенденціях,якісних характеристиках та
                    побажаннях клієнтів.
                </p>
                <p>Також асортимент часто поповнюється новими колекціями.</p>
                <p>
                    Ми пропонуємо вам :сумки,рюкзаки,клатчі,гаманці,шопери та
                    поясні сумочки.
                </p>
                <p>
                    Кожен аксесуар ретельно перевіряється та гарно
                    упаковується,щоб принести максимальну радість від покупки.
                </p>
                <p>
                    У нас немає розмежування для жінок та чоловіків,у нас є
                    сумки,а яка вам подобається обираєте саме Ви.
                </p>
                <p>
                    Bags de rêve - це про мрію,яка повинна здійснитись ,а ми
                    допоможемо
                </p>
            </>
        ),
    },

    ru: {
        header: {
            menu: {
                shop: "Магазин",
                bag: "Сумки",
                backpack: "Рюкзаки",
                wallets: "Кошельки",
                brand: "Бренды",
                about: "О нас",
                contacts: "Контакты",
            },
            work: {
                head: "График работы",
                time: "пн-сб: 10:00 - 20:00",
                holiday: "вс: Выходной",
            },
        },
        main: {
            bag: "Сумки",
            backpack: "Рюкзаки",
            wallets: "Кошельки",
        },
        contacts: {
            contactHead: "Контактная информация",
            cbHead: "Обратная связь",
            inputs: {
                name: "Ваше имя",
                mail: "Почта",
                tel: "Номер телефона",
                msg: "Ваше сообщение",
                btn: "Отправить",
            },
        },
        footer: {
            return: "Обмен и возврат",
            terms: "Положения и условия",
            delivery: "Перевозки и доставка",
            contacts: "Контакты",
        },
        products: {
            filters: {
                price: "Цены",
                brand: "Бренды",
                from: "от",
                to: "до",
            },
            btn: "Фильтры",
        },
        cart: {
            btnBuy: "Оформить заказ",
            btnMore: "Обновить корзину",
            total: "Вместе",
        },
        userCart: {
            header: "Личная информация",
            name: "Имя",
            secondname: "Фамилия",
            phone: "Телефон",
            address: "Адрес",
            deliveryMethod: "Метод Доставки",
            courier: "Курьер",
            np: "Нова Почта",
            own: "Самовывоз",
            payMethod: "Метод Оплаты",
            card: "Карта",
            ondelivery: "При получении",
            btn: "Подтвердить заказ",
            alerts: {
                ok: "Ваш заказ принят в обработку! Спасибо",
                orderId: "Ваш номер заказа: ",
                warn: "Что то пошло не так",
                error: "Ошибка с созданием заказа. Позвоните для заказа",
                cardError: "Оплата картой не доступна",
                name: "Имя не указано",
                secName: "Фамилия не указана",
                address: "Телефон не указано",
                phone: "Адрес не указан",
            },
        },
        successPage: {
            head: "Спасибо!",
            ok: "Ваш заказ принят!",
        },
        terms: () => (
            <>
                <h1>Положения и условия</h1>
                <p>
                    Каждый раз, когда вы используете этот веб-сайт, вы
                    соглашаетесь с условиями Политики приватности, которая
                    действует в любое время, и вам следует ознакомиться с этим
                    текстом, чтобы убедиться, что вы согласны с ним.
                </p>
                <p>
                    1. Персональные данные, которые вы предоставляете, будут
                    обрабатываться и храниться в файле под ответственностью Bags
                    de reve с целью:
                </p>
                <p>
                    {" "}
                    I. Разработки, обеспечения и выполнения условий договора
                    купли-продажи приобретенных вами товаров или любого другого
                    договора между двумя сторонами;
                </p>
                <p> II. Обработки ваших запросов;</p>
                <p>
                    {" "}
                    III. Предоставления вам информации о товарах, скидках и
                    других обновлениях;
                </p>
                <p>
                    {" "}
                    IV. В случае, если вы предоставляете нам информацию о
                    третьих лицах, вы несете ответственность за информирование и
                    получение их согласия на предоставление этой информации в
                    целях, описанных ниже. В случае приобретения товара,
                    предоставленная информация третьей стороны будет
                    использоваться только для (а) организации доставки или
                    проверки получения товара и (б) участия в обработке любого
                    входящего запроса, который может возникнуть у вас или
                    третьей стороны;
                </p>
                <p>
                    2. Личная информация, предоставленная через контактную форму
                    продаж в магазине, доступную на веб-сайте, а также
                    информация, предоставленная по электронной почте службе
                    поддержки клиентов, будет обрабатываться Bags de reve и
                    будет использоваться исключительно для решения поставленных
                    вопросов.
                </p>
                <p>
                    3.Bags de reve несет ответственность за файл, обязуется
                    соблюдать конфиденциальность вашей личной информации и
                    гарантирует, что вы сможете воспользоваться своими правами
                    на доступ, изменение, отмену и отрицание данных по
                    электронной почте на адрес emailcompany@gmail.com. При
                    необходимости мы попросим вас предоставить нам копию вашего
                    удостоверения личности - паспорта или другого
                    действительного документа, удостоверяющего личность. В
                    случае, если вы решите воспользоваться такими правами если
                    ваша электронная почта является частью персональных данных,
                    которые вы нам предоставили, мы будем благодарны, если в
                    этом случае будет описано обстоятельство, указывающее на
                    адрес электронной почты, на которую осуществляются права,
                    изменения, отмена и возражения.
                </p>
            </>
        ),
        return: () => (
            <>
                <h1>Обмен и возврат</h1>
                <p>
                    1. Чтобы оформить обмен/возврат заказа, ваш товар должен
                    быть в том же состоянии, в котором вы его получили,
                    неношеный или неиспользованный, с бирками и в оригинальной
                    упаковке. Вам также понадобится квитанция или подтверждение
                    покупки.
                </p>
                <p>
                    2. Обратитесь к нам по адресу emailcompany@gmail.com, чтобы
                    начать обмен/возврат в течение 14 дней с даты получения
                    заказа. Если ваш обмен/возврат будет принят, мы вышлем вам
                    инструкции как и куда отправить посылку.
                </p>
                <p>
                    3. Пожалуйста, проверьте свой заказ при получении и
                    безотлагательно свяжитесь с нами, если товар неисправен,
                    поврежден или если вы получили не тот товар, чтобы мы могли
                    оценить проблему и исправить ее.
                </p>
                <p>
                    4. Вы несете ответственность за доставку нам ваших возвратов
                    с помощью перевозчика по вашему выбору. Как только мы
                    получим ваш возврат и проверим качество, мы обработаем ваше
                    возмещение с помощью способа оплаты, который использовался в
                    оригинальном заказе. Обратите внимание, что мы не несем
                    ответственности за любые изменения курсов валют.
                </p>
                <p>
                    5. Мы оставляем за собой право не принимать
                    обмененные/возвращенные товары, если они были отправлены на
                    наш склад после 14-дневного срока, или если состояние
                    товаров отличается от того, в котором вы их получили.
                </p>
                <p>
                    6. К сожалению, мы не принимаем обмен/возврат товаров по
                    истечении 14 дней с даты получения заказа.
                </p>
                <p>
                    7. Мы сообщим вам, как только получим и проверим ваш
                    обмен/возврат, и сообщим, был ли обмен/возврат одобрен или
                    нет. При одобрении возврата вам будут автоматически
                    возвращены средства первоначальным способом оплаты. Помните,
                    что вашему банку или эмитенту кредитной карты также может
                    потребоваться некоторое время, чтобы обработать и
                    осуществить возврат.
                </p>
                <p>
                    8. Обратите внимание, что при оплате банковской картой срок
                    возврата средств зависит от политики банка, выпустившего
                    карту.
                </p>
            </>
        ),
        about: () => (
            <>
                <h1>O нас</h1>
                <p>
                    Bags de rêve - место, где каждый найдет идеальную сумку или
                    рюкзак.
                </p>
                <p>
                    Мировые бренды с отличным качеством и доступной ценой-это о
                    нас.
                </p>
                <p> Вся продукция оригинальна.</p>
                <p>
                    {" "}
                    Широкий ассортимент включает в себя от классических моделей
                    до оригинальных дизайнерских решений.
                </p>
                <p>
                    {" "}
                    Bags de rêve имеет в своем арсенале такие всемирно известные
                    бренды как: Céline, Versace, Ermanno Scervino, Brunelello
                    Cucinelli, Patrizia Pepe, Moschino, Love Moschino, Moschino
                    Couture, Valentino и многие другие.
                </p>
                <p>
                    {" "}
                    Наши специалисты проводят тщательную селекцию товара,
                    основываясь на модных тенденциях, качественных
                    характеристиках и пожеланиях клиентов.
                </p>
                <p>
                    {" "}
                    Также ассортимент частенько пополняется новыми коллекциями.
                </p>
                <p>
                    {" "}
                    Мы предлагаем вам: сумки, рюкзаки, клатчи, кошельки, шоперы
                    и поясные сумочки.
                </p>
                <p>
                    {" "}
                    У нас нет разграничения для женщин и мужчин, у нас есть
                    сумки, которая вам нравится выбираете именно Вы.
                </p>
                <p>
                    {" "}
                    Bags de rêve - это о мечте, которая должна осуществиться, а
                    мы поможем
                </p>
            </>
        ),
    },
};

export default TranslateText;
